IDENTIFICATION DIVISION.
PROGRAM-ID.  "NKU CSC407 OLDIE ASSIGNMENT".

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. LUCAS-UBUNTU.
OBJECT-COMPUTER. LUCAS-UBUNTU.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT INV-FILE ASSIGN TO "data_files/inventory.dat".
	SELECT CUST-FILE ASSIGN TO "data_files/customers.dat".
	SELECT TRANS-FILE ASSIGN TO "data_files/transactions.dat".
	SELECT ERROR-FILE ASSIGN TO "data_files/errors.dat".
DATA DIVISION.
FILE SECTION.
FD INV-FILE
	LABEL RECORDS ARE STANDARD
	RECORD CONTAINS 55 CHARACTERS.

01 INVENTORY-RECORD.
	02 INV-ITEM-NO			PICTURE IS 9(6).
	02 FILLER			PICTURE IS X(5).
	02 INV-ITEM-NAME		PICTURE IS X(25).
	02 INV-QTY			PICTURE IS 9(2).
	02 FILLER			PICTURE IS X(5).
	02 INV-REORDER-PT		PICTURE IS 9(2).
	02 FILLER			PICTURE IS X(5).
	02 INV-PRICE			PICTURE IS 99V99.

FD CUST-FILE
	LABEL RECORDS ARE STANDARD
	RECORD CONTAINS 87 CHARACTERS.

01 CUSTOMER-RECORD.
	02 CUST-NO		PICTURE IS 9(5).
	02 FILLER		PICTURE IS X(5).
	02 CUST-NAME		PICTURE IS X(23).
	02 CUST-STREET		PICTURE IS X(23).
	02 CUST-CITY		PICTURE IS X(13).
	02 CUST-REGION		PICTURE IS X(12).
	02 CUST-PAST-DUE	PICTURE IS 999V99.

FD TRANS-FILE
	LABEL RECORDS ARE STANDARD
	RECORD CONTAINS 29 CHARACTERS.

01 TRANSACTION-RECORD.
	02 TRANS-CUST-NO	PICTURE IS 9(5).
	02 FILLER		PICTURE IS X(5).
	02 TRANS-ITEM-NO	PICTURE IS 9(6).
	02 FILLER		PICTURE IS X(6).
	02 TRANS-QTY-ORD	PICTURE IS 9.
	02 FILLER		PICTURE IS X(5).
	02 TRANS-CODE		PICTURE IS X.


FD ERROR-FILE
	LABEL RECORDS ARE STANDARD
	RECORD CONTAINS 52 CHARACTERS.

01 ERROR-RECORD.
	02 ERROR-CUST-NO	PICTURE IS 9(5).
	02 FILLER		PICTURE IS X(5).
	02 ERROR-ITEM-NO	PICTURE IS 9(6).
	02 FILLER		PICTURE IS X(5).
	02 ERROR-QTY-ORD	PICTURE IS 9(1).
	02 FILLER		PICTURE IS X(5).
	02 ERROR-CODE		PICTURE IS X(25).

WORKING-STORAGE SECTION.
01 SWITCHES.
	02 TRANS-EOF-SWITCH	PICTURE IS X.
01 WS-CUST-TABLE.
	02 WS-CUST-DETAILS OCCURS 10 TIMES.
		03 WS-CUST-NO		PICTURE IS 9(5).
		03 WS-CUST-NAME		PICTURE IS X(23).
        	03 WS-CUST-STREET	PICTURE IS X(23).
		03 WS-CUST-CITY		PICTURE IS X(13).
		03 WS-CUST-REGION	PICTURE IS X(12).
		03 WS-CUST-PAST-DUE	PICTURE IS 999V99.

PROCEDURE DIVISION.
000-PROCEDURE-FULFIL-ORDERS.
	
	STOP RUN.
