IDENTIFICATION DIVISION.
PROGRAM-ID.  "NKU CSC407 OLDIE ASSIGNMENT".

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. LUCAS-UBUNTU.
OBJECT-COMPUTER. LUCAS-UBUNTU.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT INV-FILE ASSIGN TO "data_files/inventory.dat"
		ORGANIZATION IS LINE SEQUENTIAL.
	SELECT CUST-FILE ASSIGN TO "data_files/customers.dat"
		ORGANIZATION IS LINE SEQUENTIAL.
	SELECT TRANS-FILE ASSIGN TO "data_files/transactions.dat"
		ORGANIZATION IS LINE SEQUENTIAL.
	SELECT ERROR-FILE ASSIGN TO "data_files/errors.dat"
		ORGANIZATION IS LINE SEQUENTIAL.
	SELECT TRANS-OUTPUT-FILE ASSIGN TO "data_files/transactions_processed.dat"
		ORGANIZATION IS LINE SEQUENTIAL.
	SELECT INV-ORDER-FILE ASSIGN TO "data_files/inventory_order.dat"
		ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD INV-FILE
	LABEL RECORDS ARE STANDARD.

01 INV-RECORD.
	02 INV-ITEM-NO			PICTURE IS X(6).
	02 FILLER			PICTURE IS X(5).
	02 INV-ITEM-NAME		PICTURE IS X(25).
	02 INV-QTY			PICTURE IS 9(2).
	02 FILLER			PICTURE IS X(5).
	02 INV-REORDER-PT		PICTURE IS 9(2).
	02 FILLER			PICTURE IS X(5).
	02 INV-PRICE			PICTURE IS 99.99.

FD CUST-FILE
	LABEL RECORDS ARE STANDARD.

01 CUST-RECORD.
	02 CUST-NO		PICTURE IS X(5).
	02 FILLER		PICTURE IS X(5).
	02 CUST-NAME		PICTURE IS X(23).
	02 CUST-STREET		PICTURE IS X(23).
	02 CUST-CITY		PICTURE IS X(13).
	02 CUST-REGION		PICTURE IS X(12).
	02 CUST-PAST-DUE	PICTURE IS 999.99.

FD TRANS-FILE
	LABEL RECORDS ARE STANDARD.

01 TRANS-RECORD.
	02 TRANS-CUST-NO	PICTURE IS X(5).
	02 FILLER		PICTURE IS X(5).
	02 TRANS-ITEM-NO	PICTURE IS 9(6).
	02 FILLER		PICTURE IS X(6).
	02 TRANS-QTY-ORD	PICTURE IS 9.
	02 FILLER		PICTURE IS X(5).
	02 TRANS-CODE		PICTURE IS X.

FD ERROR-FILE
	LABEL RECORDS ARE STANDARD.

01 ERROR-RECORD.
	02 ERROR-CUST-NO	PICTURE IS 9(5).
	02 FILLER		PICTURE IS X(5).
	02 ERROR-ITEM-NO	PICTURE IS 9(6).
	02 FILLER		PICTURE IS X(5).
	02 ERROR-QTY-ORD	PICTURE IS 9(1).
	02 FILLER		PICTURE IS X(5).
	02 ERROR-CODE		PICTURE IS X(25).

WORKING-STORAGE SECTION.
01 SWITCHES.
	02 INV-EOF-SWITCH	PICTURE IS X(1) VALUE IS 'N'.
	02 CUST-EOF-SWITCH	PICTURE IS X(1) VALUE IS 'N'.
	02 TRANS-EOF-SWITCH	PICTURE IS X(1) VALUE IS 'N'.
	02 CUST-FOUND-FLAG	PICTURE IS X(1) VALUE IS 'N'.
	02 INV-FOUND-FLAG	PICTURE IS X(1) VALUE IS 'N'.

01 WS-INV-TABLE.
	02 WS-INV-DETAIL OCCURS 24 TIMES INDEXED BY INV-INDEX.
		03 WS-INV-ITEM-NO		PICTURE IS X(6).
		03 WS-INV-ITEM-NAME		PICTURE IS X(25).
		03 WS-INV-QTY			PICTURE IS 9(2).
		03 WS-INV-REORDER-PT		PICTURE IS 9(2).
		03 WS-INV-PRICE			PICTURE IS 99.99.

01 WS-CUST-TABLE.
	02 WS-CUST-DETAIL OCCURS 10 TIMES INDEXED BY CUST-INDEX.
		03 WS-CUST-NO		PICTURE IS 9(5).
		03 WS-CUST-NAME		PICTURE IS X(23).
		03 WS-CUST-STREET	PICTURE IS X(23).
		03 WS-CUST-CITY		PICTURE IS X(13).
		03 WS-CUST-REGION	PICTURE IS X(12).
		03 WS-CUST-PAST-DUE	PICTURE IS 999.99.

01 WORK-FIELDS.
	02 INV-NUM-IN		PIC S9(5) VALUE 0.
	02 CUST-NUM-IN		PIC S9(5) VALUE 0.

PROCEDURE DIVISION.
000-FULFILL-ORDERS.
	PERFORM 010-IMPORT-INVENTORY.
	PERFORM 020-IMPORT-CUSTOMER.
	PERFORM 030-READ-TRANSACTIONS.
	STOP RUN.
	
010-IMPORT-INVENTORY.
	OPEN INPUT INV-FILE.
	PERFORM UNTIL INV-EOF-SWITCH IS EQUAL TO 'Y'
		READ INV-FILE INTO INV-RECORD
			AT END
				MOVE 'Y' TO INV-EOF-SWITCH
			NOT AT END
				ADD 1 TO INV-NUM-IN
				MOVE INV-ITEM-NO TO WS-INV-ITEM-NO(INV-NUM-IN)
				MOVE INV-ITEM-NAME TO WS-INV-ITEM-NAME(INV-NUM-IN)
				MOVE INV-QTY TO WS-INV-QTY(INV-NUM-IN)
				MOVE INV-REORDER-PT TO WS-INV-REORDER-PT(INV-NUM-IN)
				MOVE INV-PRICE TO WS-INV-PRICE(INV-NUM-IN)
		END-READ
	END-PERFORM.
	CLOSE INV-FILE.

020-IMPORT-CUSTOMER.
	OPEN INPUT CUST-FILE.
	PERFORM UNTIL CUST-EOF-SWITCH IS EQUAL TO 'Y'
		READ CUST-FILE INTO CUST-RECORD
			AT END
				MOVE 'Y' TO CUST-EOF-SWITCH
			NOT AT END
				ADD 1 TO CUST-NUM-IN
				MOVE CUST-NO TO WS-CUST-NO(CUST-NUM-IN)
				MOVE CUST-NAME TO WS-CUST-NAME(CUST-NUM-IN)
				MOVE CUST-STREET TO WS-CUST-STREET(CUST-NUM-IN)
				MOVE CUST-CITY TO WS-CUST-CITY(CUST-NUM-IN)
				MOVE CUST-REGION TO WS-CUST-REGION(CUST-NUM-IN)
				MOVE CUST-PAST-DUE TO WS-CUST-PAST-DUE(CUST-NUM-IN)
		END-READ
	END-PERFORM.
	CLOSE CUST-FILE.

030-READ-TRANSACTIONS.
	OPEN INPUT TRANS-FILE.
	OPEN OUTPUT ERROR-FILE.
	PERFORM UNTIL TRANS-EOF-SWITCH IS EQUAL TO 'Y'
		READ TRANS-FILE INTO TRANS-RECORD
		AT END
			MOVE 'Y' TO TRANS-EOF-SWITCH
		NOT AT END
			PERFORM 031-PROCESS-TRANSACTION
	END-PERFORM.
	CLOSE TRANS-FILE.
	CLOSE ERROR-FILE.

031-PROCESS-TRANSACTION.
	MOVE SPACE TO ERROR-RECORD.
	PERFORM 032-CUST-NO-SEARCH.
	IF CUST-FOUND-FLAG IS EQUAL TO "N" THEN
		MOVE 'INVALID CUSTOMER NO' TO ERROR-CODE
		PERFORM 040-LOG-ERROR
	ELSE 
		PERFORM 033-ITEM-NO-SEARCH
		IF INV-FOUND-FLAG IS EQUAL TO "N" THEN
			MOVE 'INVALID PRODUCT NO' TO ERROR-CODE
			PERFORM 040-LOG-ERROR
		ELSE
			DISPLAY 'PROCESS VALID TRANSACTION'
		END-IF
	END-IF.

032-CUST-NO-SEARCH.
	MOVE 'N' TO CUST-FOUND-FLAG.
	SET CUST-INDEX TO 1.
	SEARCH WS-CUST-DETAIL
		AT END DISPLAY "INVALID CUSTOMER"
		WHEN WS-CUST-NO(CUST-INDEX) = TRANS-CUST-NO
			MOVE "Y" TO CUST-FOUND-FLAG
	END-SEARCH.

033-ITEM-NO-SEARCH.
	MOVE 'N' TO INV-FOUND-FLAG.
	SET INV-INDEX to 1.
	SEARCH WS-INV-DETAIL
		AT END DISPLAY "INVALID PRODUCT"
		WHEN WS-INV-ITEM-NO(INV-INDEX) = TRANS-ITEM-NO
			MOVE "Y" TO INV-FOUND-FLAG
	END-SEARCH.

040-LOG-ERROR.
	MOVE TRANS-CUST-NO TO ERROR-CUST-NO.
	MOVE TRANS-ITEM-NO TO ERROR-ITEM-NO.
	MOVE TRANS-QTY-ORD TO ERROR-QTY-ORD.
	WRITE ERROR-RECORD.
