IDENTIFICATION DIVISION.
PROGRAM-ID.  "NKU CSC407 OLDIE ASSIGNMENT".

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. LUCAS-UBUNTU.
OBJECT-COMPUTER. LUCAS-UBUNTU.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT INV-FILE ASSIGN TO "data_files/inventory.dat"
		ORGANIZATION IS LINE SEQUENTIAL.
	SELECT CUST-FILE ASSIGN TO "data_files/customers.dat"
		ORGANIZATION IS LINE SEQUENTIAL.
	SELECT TRANS-FILE ASSIGN TO "data_files/transactions.dat"
		ORGANIZATION IS LINE SEQUENTIAL.
	SELECT ERROR-FILE ASSIGN TO "data_files/errors.dat"
		ORGANIZATION IS LINE SEQUENTIAL.
	SELECT TRANS-OUTPUT-FILE ASSIGN TO "data_files/transactions_processed.dat"
		ORGANIZATION IS LINE SEQUENTIAL.
	SELECT INV-ORDER-FILE ASSIGN TO "data_files/inventory_order.dat"
		ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD INV-FILE
	LABEL RECORDS ARE STANDARD.

01 INVENTORY-RECORD.
	02 INV-ITEM-NO			PICTURE IS X(6).
	02 FILLER			PICTURE IS X(5).
	02 INV-ITEM-NAME		PICTURE IS X(25).
	02 INV-QTY			PICTURE IS 9(2).
	02 FILLER			PICTURE IS X(5).
	02 INV-REORDER-PT		PICTURE IS 9(2).
	02 FILLER			PICTURE IS X(5).
	02 INV-PRICE			PICTURE IS 99.99.

WORKING-STORAGE SECTION.
01 SWITCHES.
	02 INV-EOF-SWITCH	PICTURE IS X(1) VALUE IS 'N'.

01 WS-INVENTORY-TABLE.
	02 WS-INV-DETAIL OCCURS 24 TIMES INDEXED BY INV-INDEX.
		03 WS-INV-ITEM-NO		PICTURE IS X(6).
		03 WS-INV-ITEM-NAME		PICTURE IS X(25).
		03 WS-INV-QTY			PICTURE IS 9(2).
		03 WS-INV-REORDER-PT		PICTURE IS 9(2).
		03 WS-INV-PRICE			PICTURE IS 99.99.

01 WORK-FIELDS.
	02 INV-NUM-IN		PIC S9(5) VALUE 0.

PROCEDURE DIVISION.
000-FULFILL-ORDERS.
	PERFORM
		010-IMPORT-INVENTORY
	STOP RUN.
	
010-IMPORT-INVENTORY.
	OPEN INPUT INV-FILE.
	PERFORM UNTIL INV-EOF-SWITCH IS EQUAL TO 'Y'
		READ INV-FILE INTO INVENTORY-RECORD
			AT END
				MOVE 'Y' TO INV-EOF-SWITCH
			NOT AT END
				ADD 1 TO INV-NUM-IN
				MOVE INV-ITEM-NO TO WS-INV-ITEM-NO(INV-NUM-IN)
				MOVE INV-ITEM-NAME TO WS-INV-ITEM-NAME(INV-NUM-IN)
				MOVE INV-QTY TO WS-INV-QTY(INV-NUM-IN)
				MOVE INV-REORDER-PT TO WS-INV-REORDER-PT(INV-NUM-IN)
				MOVE INV-PRICE TO WS-INV-PRICE(INV-NUM-IN)
		END-READ
	END-PERFORM.
	CLOSE INV-FILE.


